Repository: sheilagomes/wp-trad
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: This is still under development, but you can try it out now!
pt_br: Isso ainda está em desenvolvimento, mas você já pode testar!

source: This is the first step toward an exciting new future with a streamlined editing experience across your site.
pt_br: O primeiro passo para um futuro emocionante, com uma experiência de edição mais simples em todas as partes do seu site.

source: This page will explain why this matters to you, and then how you can fix it.
pt_br: Esta página explica por que isso importa para você e o que você precisa fazer.

source: This plugin isn’t perfect and may miss items or flag false positives, but it does work in most cases.
pt_br: Este plugin não é perfeito, podendo ignorar alguns itens ou criar falsos positivos, mas ele funciona na maioria dos casos.

source: This release also includes a pair of security fixes that handle how comments are filtered and then stored in the database.
pt_br: Esta versão também inclui algumas correções de segurança que tratam como os comentários são filtrados e então gravados no banco de dados.

source: This release candidate includes a fix for some scripts not loading on subdirectory installs (#45469), and user locale settings not being loaded in the block editor (#45465).
pt_br: Este release candidate inclui um ajuste para alguns scrips que não eram carregados em instalações em subdiretórios (#45469) e configurações de locale de usuários não sendo incluídas no editor de blocos (#45465).

source: This release includes 18 Privacy fixes focused on ensuring consistency and flexibility in the new personal data tools that were added in 4.9.6, including:
pt_br: Esta versão inclui 18 ajustes de privacidade, com foco em assegurar a consistência e a flexibilidade das novas ferramentas de dados pessoais que foramadicionadas na versão 4.9.6, incluindo:

source: This release includes the final About page design.
pt_br: Esta versão traz o visual final da página Sobre.

source: This release was led by Matt Mullenweg, along with Gary Pendergast as Senior Code Reshuffler and Poet.
pt_br: Este lançamento foi liderado por Matt Mullenweg junto com Gary Pendergast como Reorganizador de código senior e Poeta.

source: This section starts off with some warnings, but don’t be afraid!
pt_br: Essa seção começa com alguns avisos, mas não se assuste!

source: This security and maintenance release introduces 10 fixes and enhancements, including changes designed to help hosts prepare users for the minimum PHP version bump coming in 5.2.
pt_br: Este lançamento de segurança e manutenção traz 10 correções e melhorias, incluindo mudanças feitas para ajudar serviços de hospedagem a preparar os usuários para a alteração da versão mínima do PHP planejada para o WP 5.2.

source: This update includes a host of tweaks and bug fixes, including:
pt_br: Esta atualização contém vários ajustes, incluindo:

source: Though we have many plugins that create privacy pages, we need means to generate a unified, comprehensive privacy policy.
pt_br: Apesar de termos muitos plugins que criem páginas de privacidade, nós precisamos de formas para gerar uma política de privacidade unificada e abrangente.

source: Thus, exactly how to do the update depends on your hosting company.
pt_br: Sendo assim, exatamente como fazer a atualização depende da sua empresa de hospedagem.

source: TinyMCE has been upgraded to version 4.9.2 (#46094).
pt_br: O TinyMCE foi atualizado para a versão 4.9.2 (#46094).

source: To all of you: let’s celebrate!
pt_br: Vamos celebrar!

source: To distribute copies of your modified versions to others.
pt_br: Distribuir cópias de suas versões modificadas a outros.

source: To help you check if you’re prepared for this change, WordPress 5.1 will show you a warning and help you upgrade your version of PHP, if necessary.
pt_br: Para ajudá-lo a verificar se você está preparado para esta mudança, o WordPress 5.1 exibirá um aviso e o auxiliará a atualizar a sua versão de PHP, se necessário.

source: To help you check if you’re prepared for this change, WordPress 5.2 will show you a warning and help you upgrade your version of PHP, if necessary.
pt_br: Para ajudar a verificar se o seu site está preparado para esta mudança, o WordPress 5.2 exibirá um aviso e ajudará no processo de atualização do seu PHP se for preciso.

source: To help you keep track of these blocks, and only show the ones you need, there’s a new block management tool to switch blocks on and off.
pt_br: Para exibir apenas os blocos que precisar, agora existe uma nova ferramenta de gerenciamento de blocos para ativar e desativar os blocos.

source: To keep you informed, we publish developers notes on the Make WordPress Core blog throughout the release cycle.
pt_br: Para mais informações nós publicamos notas para os desenvolvedores no blog Make WordPress Core durante todo o ciclo de lançamento.

source: To keep you informed, we publish developers’ notes on the Make WordPress Core blog throughout the release cycle.
pt_br: Para mais informações nós publicamos notas para os desenvolvedores no blog Make WordPress Core durante todo o ciclo de lançamento.

source: To redistribute.
pt_br: Redistribuir cópias.

source: To run WordPress we recommend your host supports:
pt_br: Para executar o WordPress, recomendamos que o seu host suporte:

source: To run the program for any purpose.
pt_br: Executar o programa para qualquer propósito.

source: To study how the program works and change it to make it do what you wish.
pt_br: Estudar como o programa funciona e adaptá-lo às suas necessidades.

source: To test WordPress 4.9, try the WordPress Beta Tester plugin (you’ll want “bleeding edge nightlies”).
pt_br: Para testar o WordPress 4.9 tente o plugin WordPress Beta Tester (você vai querer a versão "mais recente noturna").

source: To test WordPress 5.0, you can use the WordPress Beta Tester plugin or you can download the release candidate here (zip).
pt_br: Para testar o WordPress 5.0 beta, você pode usar o plugin WordPress Beta Tester ou você pode baixar o release candidate aqui (zip).

source: Top ↑
pt_br: Topo ↑

source: Topics
pt_br: Tópicos

source: Translating WordPress
pt_br: Como traduzir o WordPress

source: Translation Tools
pt_br: Ferramentas de tradução

source: Translator’s Handbook
pt_br: Manual do tradutor

source: Trusted by the Best
pt_br: Confiado pelos melhores

source: Try searching from the field above, or go to the <a href="%s">home page</a>.
pt_br: Tente procurar a partir do campo acima ou vá para a <a href="%s">página inicial</a>.

source: Try the WordPress Beta Tester plugin (choose the “bleeding edge nightlies” option)
pt_br: Usando o plugin WordPress Beta Tester (escolha a opção "bleeding edge nightlies").

source: Tweaks to improve readability and functionality on mobile devices.
pt_br: Ajustes para melhorar a leitura e funcionalidades em dispositivos móveis.

source: Tweet %s
pt_br: Tweetar %s

source: Twemoji has been updated to the latest version, 11.2.0 (#45133).
pt_br: A biblioteca Twemoji foi atualizada para a versão mais recente, 11.2.0 (#45133).

source: Twenty Nineteen
pt_br: Twenty Nineteen (2019)

source: Twenty Nineteen has also had a couple of minor tweaks.
pt_br: O Twenty Nineteen também recebeu pequenos ajustes.

source: Twenty Nineteen has been updated from its GitHub repository, this version is full of new goodies to check out:
pt_br: O Twenty Nineteen foi atualizado a partir de seu repositório no GitHub. Você pode verificar várias novidades nesta versão:

source: Twenty Nineteen is WordPress’ new default theme, it features custom styles for the blocks available by default in 5.0. Twenty Nineteen is designed to work for a wide variety of use cases.
pt_br: O Twenty Nineteen (2019) é o novo tema padrão do WordPress. Ele traz estilos personalizados para os blocos disponíveis por padrão no WP 5.0. O Twenty Nineteen foi pensado de forma que você possa usá-lo em vários tipos de sites diferentes.

source: Twenty Nineteen is being polished over on its GitHub repository.
pt_br: O Twenty Nineteen está sendo trabalhado no seu repositório do GitHub.

source: Twenty-five other bugs were fixed in WordPress 4.9.5.
pt_br: Outros vinte e cinco erros foram resolvidos no WordPress 4.9.5.

source: Updated versions of WordPress 4.9 and older releases are also available, for users who have not yet updated to 5.0.
pt_br: Versões atualizadas do WordPress 4.9 e anteriores também estão disponíveis, para os usuários que ainda não atualizaram para a versão 5.0.

source: Updated versions of WordPress 5.0 and earlier are also available for any users who have not yet updated to 5.1.
pt_br: Versões atualizadas do WordPress 5.0 e anteriores também estão disponíveis para os usuários que ainda não atualizaram para a versão 5.1.

source: Updates to values for the WP_DEBUG_LOG constant
pt_br: Atualização dos valores para a constante WP_DEBUG_LOG

source: Updating to the latest supported version (currently 7.3) can deliver a huge performance increase; up to 3 or 4x faster for older versions.
pt_br: Atualizar para a versão mais recente, atualmente a 7.3, pode gerar um ganho enorme de desempenho. Seu site pode ficar 3 ou 4 vezes mais rápido que versões mais antigas.

source: Updating your PHP version should not be a problem, but we can’t guarantee that it’s not.
pt_br: Atualizar a sua versão do PHP não deve ser um problema, mas não podemos garantir isso.

source: Use a properly generated hash for the newbloguser key instead of a determinate substring.
pt_br: Uso de um hash gerado apropriadamente para a chave newbloguser ao invés de uma determinada substring.

source: Use safe redirects when redirecting the login page if SSL is forced.
pt_br: Uso de redirecionamento seguro para a página de acesso se SSL for obrigatório.

source: User Management
pt_br: Gerenciamento de usuários

source: Username
pt_br: Nome de usuário

source: Username or Email
pt_br: Nome de usuário ou e-mail

source: Users with JavaScript disabled now see a notice when attempting to use the block editor.
pt_br: Usuários com JavaScript desabilitado agora recebem um aviso ao tentar usar o editor de blocos.

source: Version
pt_br: Versão

source: Version 5.1 of WordPress, named “Betty” in honour of acclaimed jazz vocalist Betty Carter, is available for download or update in your WordPress dashboard.
pt_br: A versão 5.1 do WordPress, com nome “Betty” em homenagem à aclamada vocalista de jazz Betty Carter, está disponível para baixar ou atualizar no seu painel do WordPress.

source: Videos, tutorials, and WordCamp sessions
pt_br: Vídeos, tutoriais e sessões de WordCamps

source: Visit the Tools menu and click on Health Check to get information that can help improve the speed and security of your site.
pt_br: Visite o menu Ferramentas e clique em Diagnóstico para obter informações que podem ajudar a melhorar a velocidade e a segurança do seu site.

source: Want to have your story featured on this page?
pt_br: Quer que a sua história apareça em destaque nesta página?

source: We are pleased to announce the immediate availability of WordPress 4.9.8, a maintenance release.
pt_br: Temos o prazer de anunciar que o WordPress 4.9.8, um atualização de manutenção, já está disponível.

source: We are, of course, quite proud of these numbers!
pt_br: Nós, claro, estamos muito orgulhosos destes números!

source: We can now get on to the final part: actually updating your website’s PHP version.
pt_br: Agora você pode ir para a parte final: realmente atualizar a versão do PHP do seu site.

source: We do understand that some sites might need some extra time, though.
pt_br: Mesmo assim, entendemos que alguns sites talvez precisem de mais tempo.

source: We fix, then we fly.
pt_br: Corrigimos e então voamos.

source: We love seeing that and we strive to continuously make WordPress better for all of you.
pt_br: Nós amamos ver isso e nos esforçamos para tornar o WordPress ainda melhor para vocês.

source: We stopped rendering AdminNotices compatibility component, as this previous attempt at backward compatibility was bringing in numerous incompatible banners and notices from plugins.
pt_br: Paramos de exibir o componente de compatibilidade AdminNotices, porque a sua intenção anterior para retrocompatibilidade estava gerando avisos demais de plugins incompatíveis.

source: We strongly encourage you to update your sites immediately.
pt_br: Encorajamos que você atualize seus sites imediatamente.

source: We will need tools for users to easily come into compliance.
pt_br: Os usuários precisarão de ferramentas para alcançar a conformidade com facilidade.

source: We would love to have your help.
pt_br: Adoraríamos contar com a sua ajuda.

source: Website
pt_br: Site

source: Website Visitors
pt_br: Visitantes do site

source: Website administrators can also see and edit that information.
pt_br: Os administradores de sites também podem ver e editar estas informações.

source: Well, not all.
pt_br: Bem, nem todos.

source: We’d like to thank everyone who works on WordPress, which is built and maintained by a huge community of volunteers that has grown alongside the CMS.
pt_br: Queremos agradecer a todos os que trabalham no WordPress, que é desenvolvido e mantido por uma comunidade imensa de voluntários, que cresceu junto com o CMS.

source: We’d love to hear from you!
pt_br: Nós vamos adorar ouvir você!

source: We’re constantly working on existing blocks, too.
pt_br: Também continuamos trabalhando nos blocos que já existem.

source: We’re fixing the bugs:
pt_br: Corrigindo os erros:

source: We’re only aware of this in the wild being triggered once in the over a million posts made with Gutenberg, but it caused a loop so we wanted to fix for RC2.
pt_br: Só soubemos que isso aconteceu uma vez em mais de um milhão de posts feitos com o Gutenberg, mas como isso causou um loop nós consertamos no RC2.

source: We’ve added an API for translating your plugin and theme strings in JavaScript files!
pt_br: Adicionamos uma API para tradução de strings em arquivos JavaScript dos seus plugins e temas!

source: We’ve added several new blocks:
pt_br: Temos vários novos blocos:

source: We’ve added support for registering and loading JavaScript translation files.
pt_br: Adicionamos suporte ao registro e carregamento de tradução de arquivos JavaScript.

source: We’ve added the sodium_compat library, which provides backwards compatibility for the Sodium-based cryptography library added in PHP 7.2.
pt_br: Adicionamos a biblioteca sodium_compat, que fornece retrocompatibilidade para a biblioteca de criptografia baseada no Sodium, adicionada no PHP 7.2.

source: We’ve asked hosting companies to submit instructions on how to update your PHP version on their hosting, and you’ll find a list of hosts who have instructions available here.
pt_br: Pedimos que algumas empresas enviassem instruções sobre como atualizar a versão do PHP em suas hospedagens e aqui você pode encontrar a lista de empresas que as enviaram.

source: We’ve made some smaller changes as well, including:
pt_br: Também fizemos algumas mudanças menores, incluindo:

source: We’ve updated to the latest version of the block editor from the Gutenberg plugin, which includes the new Format API, embedding improvements, and a variety of bug fixes.
pt_br: Atualizamos o editor de blocos com a versão mais recente do plugin Gutenberg, que inclui a nova API de Formatos, melhorias nas mídias incorporadas e uma variedade de ajustes.

source: What automated decision making and/or profiling we do with user data
pt_br: Quais tomadas de decisão ou análises de perfil automatizadas fazemos com os dados de usuários

source: What is GDPR?
pt_br: O que é o GDPR?

source: What is Internationalization?
pt_br: O que é internationalização?

source: What’s in WordPress 5.0?
pt_br: Quais são as novidades do WordPress 5.0?

source: When 30% of the internet has a reason to celebrate, you know it’s going to be great!
pt_br: Quando 30% da internet tem um motivo para comemorar, você sabe que isso vai ser ótimo!

source: When a security update is pushed for the current stable release of WordPress, the core team will also push security updates for all the releases that are capable of background updates (since WordPress 3.7), so these older but still recent versions of WordPress will receive security enhancements.
pt_br: Quando uma atualização de segurança é enviada para a versão atual do WordPress, a equipe dos arquivos básicos do WordPress também enviará atualizações de segurança para todas as versões que são capazes de realizar atualizações em segundo plano (desde o WordPress 3.7), de forma que estas versões mais antigas do WordPress também receberão melhorias de segurança.

source: When adding rel attributes to links, ensure the value isn’t empty (#45352), and that it works as expected with customizer changesets (#45292).
pt_br: Ao adicionar atributos rel aos links, assegura que o valor não é vazio (#45352) e que funciona como o esperado com conjuntos de alterações do Personalizar (#45292).

source: When starting cron under PHP-FPM, the connection will return a response immediately, even for long running cron jobs (dev note).
pt_br: Ao iniciar o sistema de agendamento de tarefas com PHP-FPM, a conexão retornará uma resposta imediatamente, mesmo para tarefas de longa duração (nota para os devesenvolvedores, em inglês).

source: When updating language packs, old language packs are now correctly deleted to avoid filling up disk space (#45468).
pt_br: Ao atualizar pacotes de idiomas, pacotes antigos agora são corretamente excluídos, evitando uso desnecessário de espaço em disco (#45468).

source: When you install new plugins, WordPress’s Site Health features will check them against the version of PHP you’re running.
pt_br: Ao instalar novos plugins, os recursos de Diagnóstico do WordPress verificarão a versão do PHP que você está usando.

source: When you log in, we will also set up several cookies to save your login information and your screen display choices.
pt_br: Quando você acessa sua conta no site, também criamos vários cookies para salvar os dados da sua conta e suas escolhas de exibição de tela.

source: Whether you’re running a photo blog, launching a new business, or supporting a non-profit, Twenty Nineteen is flexible enough to fit your needs.
pt_br: Se você tem um blog de fotografia, um site para seu novo negócio ou ajudando uma ONG, o Twenty Nineteen é flexível o suficiente para atender às suas necessidades.

source: While each WordPress API provides best practices and standardized ways to interact with and extend WordPress core software, the following WordPress APIs are the most pertinent to enforcing and hardening WordPress security:
pt_br: Enquanto cada API do WordPress fornece melhores práticas e formas padronizadas de estender e interagir com os arquivos básicos do WordPress, as seguintes APIs são as mais importantes para reforçar a segurança do WordPress:

source: While it is your responsibility to come up with the schedule of how long you keep each dataset for and why you keep it, that information does need to be listed here.
pt_br: Como é sua responsabilidade divulgar por que e por quanto tempo cada conjunto de dados é armazenado, esta informação precisa ser listada aqui.

source: Whilst you may be familiar with the importance of keeping WordPress, and your themes and plugins up-to-date, keeping PHP up-to-date is just as important.
pt_br: Você já pode ter ouvido falar da importância de manter o WordPress, seus temas e plugins atualizados, mas manter o PHP atualizado tem a mesma importância.

source: White paper content License
pt_br: Licença de conteúdo do informativo

source: Why PHP Matters To You
pt_br: Por que isso importa para você

source: Why PHP Matters To You # Why PHP Matters To You
pt_br: Por que isso importa para você# Por que isso importa para você

source: Why the urgency?
pt_br: Por que a urgência?

source: Widgets: Allow basic HTML tags in sidebar descriptions on Widgets admin screen.
pt_br: Widgets: Permite tags HTML básicas nas descrições das barras laterais na tela de administração do WordPress.

source: With a maliciously crafted comment, a WordPress post was vulnerable to cross-site scripting.
pt_br: Através de um comentário criado maliciosamente, um post do WordPress ficava vulnerável a execuções de códigos de outro site (cross-site scripting).

source: With an up-to-date version of PHP you’ll enjoy a faster, more secure website and happier visitors.
pt_br: Com uma versão atualizada do PHP você terá um site mais rápido, mais seguro e visitantes mais felizes.

source: With each new release,
pt_br: A cada nova versão,

source: With security and speed in mind, this release introduces WordPress’s first Site Health features.
pt_br: Tendo segurança e velocidade em mente, esta versão traz os primeiros recursos do Diagnóstico do sites.

source: With this release, WordPress will increase its minimum supported PHP version to 5.6.
pt_br: Nesta versão, o WordPress vai aumentar a versão mínima de PHP suportada para 5.6.

source: WooCommerce Blocks is Now a Feature Plugin, Version 1.3.0 Introduces 6 New Blocks
pt_br: WooCommerce Blocks é agora um plugin em destaque, versão 1.3.0 introduz 6 novos blocos

source: WordPress 4.9 Beta 2 is now available!
pt_br: O WordPress 4.9 Beta 2 já está disponível!

source: WordPress 4.9.1 Security and Maintenance Release
pt_br: Versão de segurança e manutenção do WordPress 4.9.1

source: WordPress 4.9.1 is now available.
pt_br: O WordPress 4.9.1 já está disponível.

source: WordPress 4.9.2 Security and Maintenance Release
pt_br: WordPress 4.9.2 – Atualização de segurança e manutenção

source: WordPress 4.9.2 is now available.
pt_br: O WordPress 4.9.2 já está disponível.

source: WordPress 4.9.5 Security and Maintenance Release
pt_br: WordPress 4.9.5 – Atualização de segurança e manutenção

source: WordPress 4.9.5 is now available.
pt_br: O WordPress 4.9.5 já está disponível.

source: WordPress 4.9.7 Security and Maintenance Release
pt_br: WordPress 4.9.7 – Atualização de segurança e manutenção

source: WordPress 4.9.7 is now available.
pt_br: O WordPress 4.9.7 já está disponível.

source: WordPress 4.9.8 Maintenance Release
pt_br: WordPress 4.9.8 – Atualização de manutenção

source: WordPress 5.0 Beta 1 is now available!
pt_br: O WordPress 5.0 Beta 1 já está disponível!

source: WordPress 5.0 Beta 2 is now available!
pt_br: O WordPress 5.0 Beta 2 já está disponível!

source: WordPress 5.0 Beta 3 is now available!
pt_br: O WordPress 5.0 Beta 3 já está disponível!

source: WordPress 5.0 Beta 4 is now available!
pt_br: O WordPress 5.0 Beta 4 já está disponível!

source: WordPress 5.0 Beta 5 is now available!
pt_br: O WordPress 5.0 Beta 5 já está disponível!

source: WordPress 5.0 introduces the new block-based post editor.
pt_br: O WordPress 5.0 traz o novo editor de posts baseado em blocos.

source: WordPress 5.0 is slated for release on November 19, and we need your help to get there.
pt_br: O lançamento do WordPress 5.0 está previsto para 19 de novembroe precisamos da sua ajuda para que isso aconteça.

source: WordPress 5.0 officially supports the upcoming PHP 7.3 release: if you’re using an older version, we encourage you to upgrade PHP on your site.
pt_br: O WordPress 5.0 tem oficialmente suporte para versão 7.3 do PHP: se você está usando uma versão anterior, sugerimos que você atualize o PHP do seu site.

source: WordPress 5.0.1 Security Release
pt_br: WordPress .5.0.1 – Atualização de segurança e manutenção

source: WordPress 5.0.1 is now available.
pt_br: O WordPress 5.0.1 já está disponível.

source: WordPress 5.0.2 Maintenance Release
pt_br: WordPress 5.0.2 – Atualização de manutenção

source: WordPress 5.0.2 is now available!
pt_br: O WordPress 5.0.2 já está disponível!
